### Creating a database engine

In [1]:
# here we are going to fire up your very first SQL engine.
# to create an engine you need to connect to the sqllite database.
from sqlalchemy import create_engine

# create engine
engine = create_engine('sqlite:///Chinook.sqlite')

### What are tables in database?

In [4]:
# listing out the tables that it contains
# import necessary table
from sqlalchemy import create_engine

# create the engine
engine = create_engine('sqlite:///datasets/Chinook.sqlite')

# save the table names to a list
table_names = engine.table_names()

# print the table names
print(table_names)

['Album', 'Artist', 'Customer', 'Employee', 'Genre', 'Invoice', 'InvoiceLine', 'MediaType', 'Playlist', 'PlaylistTrack', 'Track']

### The hello world of SQL queries

In [2]:
# you will perform SELECT * in order to retrieve all columns
# of the table
# import packages
from sqlalchemy import create_engine
import pandas as pd

# create engine
engine = create_engine('sqlite:///datasets/Chinook.sqlite')

# open engine connection: con
con = engine.connect()

# perform the query: rs
rs = con.execute('SELECT * from Album')

# save results of the query to DataFrame
df = pd.DataFrame(rs.fetchall())

# close the connection
con.close()

# print the head of the dataFrame
print(df.head())

   0                                      1  2
0  1  For Those About To Rock We Salute You  1
1  2                      Balls to the Wall  2
2  3                      Restless and Wild  2
3  4                      Let There Be Rock  1
4  5                               Big Ones  3

### customizing the hello world of SQL queries

In [4]:
# now you're going to:
# - select specified columns from a table
# - select a specified number of rows
# - import column names from the database table.

# import necessary library
import pandas as pd
from sqlalchemy import create_engine

# start the sqllite engine pointing to the database
engine = create_engine('sqlite:///datasets/Chinook.sqlite')

# open engine in context manager
# perform query and save results to DataFrame
with engine.connect() as con:
    
    # execute the query
    rs = con.execute('SELECT LastName, Title from Employee')
    
    # assign the data to a dataframe, this one we only need 3 datas
    df = pd.DataFrame(rs.fetchmany(size=3))
    
    # set the DataFrame column name from the database keys
    df.columns = rs.keys()

# Print the length of the DataFrame df
print(len(df))

# Print the head of the DataFrame df
print(df.head())

3
  LastName                Title
0    Adams      General Manager
1  Edwards        Sales Manager
2  Peacock  Sales Support Agent

### filtering your database records using SQL's WHERE clause

In [5]:
# you can also perform simple query customizations to select particular
# columns and numbers of rows by using WHERE clause

# import necessary modules
from sqlalchemy import create_engine
import pandas as pd

# create the engine
engine = create_engine('sqlite:///datasets/Chinook.sqlite')

# open engine context manager
with engine.connect() as con:
    rs = con.execute('SELECT * FROM Employee WHERE EmployeeId >= 6')
    df = pd.DataFrame(rs.fetchall())
    df.columns = rs.keys()

# Print the head of the DataFrame df
print(df.head())

   EmployeeId  LastName FirstName       Title  ReportsTo            BirthDate  \
0           6  Mitchell   Michael  IT Manager          1  1973-07-01 00:00:00
1           7      King    Robert    IT Staff          6  1970-05-29 00:00:00
2           8  Callahan     Laura    IT Staff          6  1968-01-09 00:00:00

              HireDate                      Address        City State Country  \
0  2003-10-17 00:00:00         5827 Bowness Road NW     Calgary    AB  Canada
1  2004-01-02 00:00:00  590 Columbia Boulevard West  Lethbridge    AB  Canada
2  2004-03-04 00:00:00                  923 7 ST NW  Lethbridge    AB  Canada

  PostalCode              Phone                Fax                    Email
0    T3B 0C5  +1 (403) 246-9887  +1 (403) 246-9899  michael@chinookcorp.com
1    T1K 5N8  +1 (403) 456-9986  +1 (403) 456-8485   robert@chinookcorp.com
2    T1H 1Y8  +1 (403) 467-3351  +1 (403) 467-8772    laura@chinookcorp.com

### ordering your SQL records with ORDER BY

In [6]:
# you can also order your SQL query results by using ORDER BY clause
# import necessary modules
from sqlalchemy import create_engine
import pandas as pd

# create the engine
engine = create_engine('sqlite:///datasets/Chinook.sqlite')

# open engine context manager
with engine.connect() as con:
    rs = con.execute('SELECT * FROM Employee ORDER BY BirthDate')
    df = pd.DataFrame(rs.fetchall())
    df.columns = rs.keys()

# Print the head of the DataFrame df
print(df.head())

   EmployeeId  LastName FirstName                Title  ReportsTo  \
0           4      Park  Margaret  Sales Support Agent        2.0
1           2   Edwards     Nancy        Sales Manager        1.0
2           1     Adams    Andrew      General Manager        NaN
3           5   Johnson     Steve  Sales Support Agent        2.0
4           8  Callahan     Laura             IT Staff        6.0

             BirthDate             HireDate              Address        City  \
0  1947-09-19 00:00:00  2003-05-03 00:00:00     683 10 Street SW     Calgary
1  1958-12-08 00:00:00  2002-05-01 00:00:00         825 8 Ave SW     Calgary
2  1962-02-18 00:00:00  2002-08-14 00:00:00  11120 Jasper Ave NW    Edmonton
3  1965-03-03 00:00:00  2003-10-17 00:00:00         7727B 41 Ave     Calgary
4  1968-01-09 00:00:00  2004-03-04 00:00:00          923 7 ST NW  Lethbridge

  State Country PostalCode              Phone                Fax  \
0    AB  Canada    T2P 5G3  +1 (403) 263-4423  +1 (403) 263-4289
1    AB  Canada    T2P 2T3  +1 (403) 262-3443  +1 (403) 262-3322
2    AB  Canada    T5K 2N1  +1 (780) 428-9482  +1 (780) 428-3457
3    AB  Canada    T3B 1Y7   1 (780) 836-9987   1 (780) 836-9543
4    AB  Canada    T1H 1Y8  +1 (403) 467-3351  +1 (403) 467-8772

                      Email
0  margaret@chinookcorp.com
1     nancy@chinookcorp.com
2    andrew@chinookcorp.com
3     steve@chinookcorp.com
4     laura@chinookcorp.com

### Pandas and the Hello World of SQL queries

In [2]:
# you will take advantage of the power of pandas
# to write the results of your SQL query to a DataFrame
# import packages
import pandas as pd
from sqlalchemy import create_engine

# create engine
engine = create_engine('sqlite:///datasets/Chinook.sqlite')

# execute query and store records in DataFrame
df = pd.read_sql_query('SELECT * from Album', engine)

# print the head
print(df.head())

# Open engine in context manager and store query result in df1
with engine.connect() as con:
    rs = con.execute("SELECT * FROM Album")
    df1 = pd.DataFrame(rs.fetchall())
    df1.columns = rs.keys()

# Confirm that both methods yield the same result
print(df.equals(df1))

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2
2        3                      Restless and Wild         2
3        4                      Let There Be Rock         1
4        5                               Big Ones         3
True

### pandas for more complex querying

In [4]:
# here you will become more familiar with pandas function
# read_sql_query() by using it to exeute a more complex 
# query SELECT, WHERE, and ORDER BY

# import packages
from sqlalchemy import create_engine
import pandas as pd

# create engine
engine = create_engine('sqlite:///datasets/Chinook.sqlite')

# execute query
df = pd.read_sql_query('SELECT * FROM Employee WHERE EmployeeId >= 6 ORDER BY BirthDate', engine)

# print head of DataFrame
print(df.head())

   EmployeeId  LastName FirstName       Title  ReportsTo            BirthDate  \
0           8  Callahan     Laura    IT Staff          6  1968-01-09 00:00:00
1           7      King    Robert    IT Staff          6  1970-05-29 00:00:00
2           6  Mitchell   Michael  IT Manager          1  1973-07-01 00:00:00

              HireDate                      Address        City State Country  \
0  2004-03-04 00:00:00                  923 7 ST NW  Lethbridge    AB  Canada
1  2004-01-02 00:00:00  590 Columbia Boulevard West  Lethbridge    AB  Canada
2  2003-10-17 00:00:00         5827 Bowness Road NW     Calgary    AB  Canada

  PostalCode              Phone                Fax                    Email
0    T1H 1Y8  +1 (403) 467-3351  +1 (403) 467-8772    laura@chinookcorp.com
1    T1K 5N8  +1 (403) 456-9986  +1 (403) 456-8485   robert@chinookcorp.com
2    T3B 0C5  +1 (403) 246-9887  +1 (403) 246-9899  michael@chinookcorp.com